In [1]:
import numpy as np
import pandas as pd

### `Q-1:` Write a program to create an empty series.

In [4]:
# code here
seri = pd.Series([])
seri

Series([], dtype: object)

### `Q-2:` Write a Pandas program to add, subtract, multiple and divide two Pandas Series.

In [7]:
# code here

# 2 series to perform certion operation
ser1 = pd.Series([1,2,3,4,5])
ser2 = pd.Series([6,7,8,9,10])

# add
print('Addition of series: \n',(ser1+ser2))

# sub
print('Subtraction of series: \n',(ser1-ser2))

# multi
print('Multiplication of series: \n',(ser1*ser2))

# divide
print('Division of series: \n',(ser1/ser2))

Addition of series:
 0     7
1     9
2    11
3    13
4    15
dtype: int64
Subtraction of series:
 0   -5
1   -5
2   -5
3   -5
4   -5
dtype: int64
Multiplication of series:
 0     6
1    14
2    24
3    36
4    50
dtype: int64
Division of series:
 0    0.166667
1    0.285714
2    0.375000
3    0.444444
4    0.500000
dtype: float64

### `Q-3` Write a Pandas program to compare the elements of the two Pandas Series.
Sample Series: [2, 4, 6, 8, 10], [1, 3, 5, 7, 10]

In [12]:
# code here

# series sample
s1 = pd.Series([2,4,6,8,10])
s2 = pd.Series([1,3,5,7,10])

# Apply comparision operator

print('equal : \n',(s1 == s2))

print('\nnot equal : \n',(s1 != s2))

print('\nGreather than : \n',(s1 > s2))

print('\nLess than : \n',(s1 < s2))

equal :
 0    False
1    False
2    False
3    False
4     True
dtype: bool

not equal :
 0     True
1     True
2     True
3     True
4    False
dtype: bool

Greather than :
 0     True
1     True
2     True
3     True
4    False
dtype: bool

Less than :
 0    False
1    False
2    False
3    False
4    False
dtype: bool

### `Q-5.`Write a function to change the data type of given a column or a Series. Function takes series and data type as input, returns the converted series.
```
series = pd.Series([1,2,'Python', 2.0, True, 100])
change to float type data
```
Note: Read about pd.to_numeric()

In [22]:
import pandas as pd

# Function to convert the series to the specified data type
def convert_to_col_series(series, dataType):
    try:
        # Convert non-numeric values to NaN
        converted_series = pd.to_numeric(series, errors='coerce')

        # Fill NaN values with 0 (or another value) before converting to int
        if dataType == int:
            converted_series = converted_series.fillna(0).astype(int)
        else:
            converted_series = converted_series.astype(dataType)

        return converted_series
    except Exception as e:
        return f'Error: {e}'

# Create the series with mixed data types
series = pd.Series([1, 2, 'Python', 2.0, True, 100])

# Call the function to convert the series to integer type
converted_series = convert_to_col_series(series, float)

# Print the result
print("Converted Series:")
print(converted_series)

Converted Series:
0      1.0
1      2.0
2      NaN
3      2.0
4      1.0
5    100.0
dtype: float64

Download data - https://drive.google.com/file/d/1LRhXwbEodeWXtzPhJCX0X9Lf_BECzvqb/view?usp=share_link
All Batsman runs series in IPL 2008 to 2022.

Below questions are based on this data.

### `Q-6` Find top 10 most run getter from the series.

In [30]:
ipl_runs

             batter  batsman_run
0    A Ashish Reddy          280
1          A Badoni          161
2        A Chandila            4
3          A Chopra           53
4       A Choudhary           25
..              ...          ...
600      Yash Dayal            0
601   Yashpal Singh           47
602     Younis Khan            3
603    Yuvraj Singh         2754
604          Z Khan          117

[605 rows x 2 columns]

In [31]:
import pandas as pd
import numpy as np

ipl_runs = pd.read_csv('batsman_runs_series.csv')

ipl_runs.nlargest(10, 'batsman_run')

             batter  batsman_run
569         V Kohli         6634
462        S Dhawan         6244
130       DA Warner         5883
430       RG Sharma         5881
493        SK Raina         5536
27   AB de Villiers         5181
108        CH Gayle         4997
339        MS Dhoni         4978
452      RV Uthappa         4954
256      KD Karthik         4377

In [ ]:
# code here

### `Q-7` No of players having runs above 3000

In [43]:
# code here
ipl_player_3000 = ipl_runs[ipl_runs['batsman_run'] > 3000]
ipl_player_3000.shape[0]

20

### `Q-8` No of players having runs above mean value?

In [47]:
# code here

ipl_runs_mean = ipl_runs['batsman_run'].mean()

players_above_mean = ipl_runs[ipl_runs['batsman_run'] > ipl_runs_mean]

players_above_mean.shape[0]

128

Download data - https://drive.google.com/file/d/1QZuZ5bypUInfVvarHACLAi8tXXHvb8xd/view?usp=share_link

file name - items.csv

In [48]:
items = pd.read_csv('items.csv')
items.sample(5)

               item_name item_price
577   Chicken Soft Tacos    $16.98
3904     Chicken Burrito     $8.49
3289     Chicken Burrito     $8.75
639    6 Pack Soft Drink     $6.49
606     Steak Salad Bowl    $11.89

###`Q-9`
    i. Read `items.csv` making `item_name` as index.
    ii. Show no of nan values
    ii. Item price is given in $, so convert it to rupees without currency symbol.
    iii. Make data type of newly made series as float.
    iv. Fill nan with mean of the series


How csv file looks

```
item_name	item_price
Chips and Fresh Tomato Salsa	$2.39
Izze	$3.39
Nantucket Nectar	$3.39
Chips and Tomatillo-Green Chili Salsa	$2.39
Chicken Bowl	$16.98

```

In [ ]:
# code here

###`Q-10`:
    i. Find mean price
    ii. Find 30th and 6th percentile value
    iii. Plot Histogram on price with bin size 50
    iv. No of items price lies between [1000 to 2000]

In [ ]:
# code here